inference/inference-Leonardo/results/vllm/sonnet/gemma-3-12b-it/Nodes_1-GPUs_4-TP_4-PP_1/launch-1/logs_benchmarking_100-concurrency.log
INFO 09-15 17:19:40 [__init__.py:244] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='localhost', port=2950, endpoint='/v1/completions', dataset=None, dataset_name='sonnet', dataset_path='/leonardo_scratch/large/userinternal/rscheda0/benchmarks/inference/inference-Leonardo/benchmarks/datasets/sonnet.txt', max_concurrency=100, model='/leonardo_scratch/large/userinternal/rscheda0/models/gemma-3-12b-it', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, metadata=None, result_dir=None, result_filename='/leonardo_scratch/large/userinternal/rscheda0/benchmarks/inference/inference-Leonardo/results/vllm/sonnet/gemma-3-12b-it/Nodes_1-GPUs_4-TP_4-PP_1/launch-1/Concurrency_100.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto')
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100
============ Serving Benchmark Result ============
Successful requests:                     1000      
Benchmark duration (s):                  95.79     
Total input tokens:                      513112    
Total generated tokens:                  149992    
Request throughput (req/s):              10.44     
Output token throughput (tok/s):         1565.82   
Total Token throughput (tok/s):          6922.39   
---------------Time to First Token----------------
Mean TTFT (ms):                          225.84    
Median TTFT (ms):                        216.37    
P99 TTFT (ms):                           429.81    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          62.68     
Median TPOT (ms):                        61.93     
P99 TPOT (ms):                           67.78     
---------------Inter-token Latency----------------
Mean ITL (ms):                           62.68     
Median ITL (ms):                         61.72     
P99 ITL (ms):                            70.92     
==================================================